import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';
import 'package:font_awesome_flutter/font_awesome_flutter.dart';
import 'package:productive_muslim/constant.dart';
import 'package:productive_muslim/pages/zakat_calculator.dart';
import 'package:productive_muslim/widgets/DetailsCard.dart';

class Zakat extends StatefulWidget {
  const Zakat({Key? key}) : super(key: key);

  @override
  State<Zakat> createState() => _ZakatState();
}

class _ZakatState extends State<Zakat> {

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: backColor,
      appBar: AppBar(
        backgroundColor: Colors.white,
        centerTitle: true,
        iconTheme: IconThemeData(
          color: zColor,
        ),
        title: Text('যাকাত ক্যালকুলেটর',
          style: TextStyle(
            color: zColor,
          ),),
        shadowColor: Colors.white,
        elevation: 3,
        actions: [
          IconButton(
              onPressed: (){
                Navigator.push(context, MaterialPageRoute(builder: (context) => ZakatCalculator()));
              },
              icon: Icon(Icons.add)
          ),
        ],
      ),
      body: Padding(
        padding: const EdgeInsets.all(8.0),
        child: Column(
          mainAxisAlignment: MainAxisAlignment.spaceBetween,
          children: [
            Flexible(
              child: ListView(
                shrinkWrap: true,
                children: [
                  DetailsCard(
                      number: '১  ',
                      title: '  যাকাতের বিধান',
                      desc: 'ইসলামে ৭.৫ ভরি স্বর্ণ কিংবা ৫২.৫ ভরি রুপা অথবা সমপরিমাণ অর্থ এক বছর যাবত গচ্ছিত থাকলে তার বাজার মুল্য অনুযায়ী মোট অর্থের শতকরা ২.৫ % যাকাত দেওয়ার বিধান রয়েছে'
                  ),
                  DetailsCard(
                      number: '২  ',
                      title: '  যাকাত বন্টনের নির্ধারিত খাত',
                      desc: 'যাকাত বন্টনের নির্ধারিত ৮টি খাতের বিবরণ : '
                          '\nপ্রথম খাত : ফকির- ফকির হলো সেই ব্যক্তি যার নিসাব পরিমাণ সম্পদ নেই। যে ব্যক্তি রিক্তহস্ত, অভাব মেটানোর যোগ্য সম্পদ নেই, ভিক্ষুক হোক বা না হোক, এরাই ফকির। যেসব স্বল্প সামর্থ্যের দরিদ্র মুসলমান যথাসাধ্য চেষ্ট করা সত্ত্বেও বা দৈহিক অক্ষমতাহেতু প্রাত্যহিক ন্যায়সঙ্গত প্রয়োজনটুকু মেটাতে পারে না, তারাই ফকির। কারো মতে যার কাছে একবেলা বা একদিনের খাবার আছে সে ফকীর।'
                          '\nদ্বিতীয় খাত : মিসকীন - মিসকীন সেই ব্যক্তি যার কিছুই নেই, যার কাছে একবেলা খাবারও নেই। যেসব লোকের অবস্থা এমন খারাপ যে, পরের নিকট সওয়াল করতে বাধ্য হয়, নিজের পেটের আহারও যারা যোগাতে পারে না, তারা মিসকীন । মিসকীন হলো যার কিছুই নেই, সুতরাং যার কাছে প্রয়োজনের অতিরিক্ত নিসাব পরিমাণ অর্থ সম্পদ নেই, তাকে যাকাত দেয়া যাবে এবং সেও নিতে পারবে। তবে লক্ষ্য রাখতে হবে, ফকির বা মিসকীন যাকেই জাকাত দেয়া হবে, সে যেন মুসলমান হয় এবং প্রয়োজনের অতিরিক্ত নিসাব পরিমাণ সম্পদের মালিক না হয়।'
                          '\nতৃতীয় খাত : আমেলীন- ইসলামি সরকারের পক্ষে লোকদের কাছ থেকে যাকাত, উসর প্রভৃতি আদায় করে বায়তুল মালে জমা প্রদান, সংরক্ষণ ও বন্টনের কার্যে নিয়োজিত ব্যক্তিবর্গ। এদের পারিশ্রমিক যাকাতের খাত থেকেই আদায় করা যাবে। কোরআনে বর্ণিত আটটি খাতের মধ্যে এ একটি খাতই এমন, যেখানে সংগৃহীত যাকাতের অর্থ থেকেই পারিশ্রমিক দেয়া হয়। এ খাতের বৈশিষ্ট্য হলো এতে ফকীর বা মিসকীন হওয়া শর্ত নয়। পক্ষান্তরে, অবশিষ্ট ৫টি খাতে দরিদ্র ও অভাবগ্রস্থ দূরীকরণে যাকাত আদায় শর্ত।'
                          '\nচতুর্থ খাত : মুমু\'আল্লাফাতুল কুলুব (চিত্ত জয় করার জন্য)- নতুন মুসলিম যার ঈমান এখনো পরিপক্ক হয়নি অথবা ইসলাম গ্রহণ করতে ইচ্ছুক অমুসলিম। যাদের চিত্ত (দ্বীন ইসলামের প্রতি আকর্ষণ করে) আকর্ষণ ও উৎসাহিত করণ আবশ্যকীয় মনে করে যাকাত দান করা হয়, যাতে তাদের ঈমান পরিপক্ক হয়। এ খাতের আওতায় দুঃস্থ নওমুসলিম ব্যক্তিদের যাকাত প্রদানের ব্যাপারে ফকিহরা অভিমত প্রদান করেছেন।'
                          '\nপঞ্চম খাত : ক্রীতদাস/বন্দী মুক্তি- এ খাতে ক্রীতদাস-দাসী/বন্দী মুক্তির জন্য যাকাতের অর্থ ব্যয় করা যাবে। অন্যায়ভাবে কোনো নিঃস্ব ও অসহায় ব্যক্তি বন্দী হলে তাকেও মুক্ত করার জন্য যাকাতের অর্থ ব্যয় করা যাবে। বর্তমান সময়ে ক্রীতদাস প্রথা বিলুপ্ত  হওয়ায় এই খাতটি আর বিবেচ্য নয়।'
                          '\nষষ্ঠ খাত : ঋণগ্রস্থ- এ ধরনের ব্যক্তিকে তার ঋণ মুক্তির জন্য যাকাত দেয়ার শর্ত হচ্ছে- সেই ঋণগ্রস্থের কাছে ঋণ পরিশোধ পরিমাণ সম্পদ না থাকা। আবার কোনো ইমাম এ শর্তারোপও করেছেন যে, সে ঋণ যেন কোনো অবৈধ কাজের জন্য- যেমন মদ কিংবা নাজায়েয প্রথা অনুষ্ঠান ইত্যাদির জন্য ব্যয় না করে।'
                          '\nসপ্তম খাত : আল্লাহর পথে-  সম্বলহীন মুজাহিদের যুদ্ধাস্ত্র/সরঞ্জাম উপকরণ সংগ্রহ এবং নিঃস্ব ও অসহায় গরীব দ্বীনি শিক্ষারত শিক্ষার্থীকে এ খাত থেকে যাকাত প্রদান করা যাবে। এ ছাড়াও ইসলামের মাহাত্ম ও গৌরব প্রচার ও প্রসারের কাজে নিয়োজিত থাকার কারণে যারা জীবিকা অর্জনের  এবং যে আলিমগণ দ্বীনি শিক্ষাদানের কাজে ব্যাপৃত থাকায় জীবিকা অর্জনের অবসর পান না। তারা অসচ্ছল হলে সর্বসম্মতভাবে তাদেরকেও যাকাত দেয়া যাবে।'
                          '\nঅষ্টম খাত : অসহায় মুসাফির- যে সমস্ত মুসাফির অর্থ কষ্টে নিপতিত তাদেরকে মৌলিক প্রয়োজন পুরণ হওয়ার মতো এবং বাড়ী ফিরে আসতে পারে এমন পরিমাণ অর্থ যাকাত থেকে প্রদান করা যায়।'
                          '\nএক নজরে জাকাত আদায় না করার পরিণতি :'
                          '\n০১. যাকাত না দেয়া প্রতিটি সম্পদের একটি আকৃতি হবে। যা আগুনে উত্তপ্ত করে ব্যক্তির শরীরে দাগিয়ে দেয়া হবে।'
                          '\n০২. কোনো কোনো সম্পদ বিষাক্ত সাপে পরিণত হবে এবং যাকাত আদায়কারীকে দংশন করতে থাকবে।'
                          '\n০৩. প্রাণী জাতীয় সম্পদসমূহ কোনটা শিং দিয়ে আঘাত করবে আবার কোনটা দাঁত দিয়ে কামড় দেবে।'
                          '\nযাকাত আদায়ের বিবিধ উপকারিতা ও শিক্ষা :'
                          '\n০১. গরীবের প্রযোজন পূর্ণ হয়।'
                          '\n০২. অভিশপ্ত পুঁজিতন্ত্রের মূলোৎপাটন হয়।'
                          '\n০৩. সম্পদ কুক্ষিগত করার মানসিকতাকে শেষ করে সমাজে অর্থনৈতিক ভারসাম্য সৃষ্টি হয়।'
                          '\n০৪. মুসলমানদের সামগ্রিক শক্তি বৃদ্ধি পায়।'
                          '\n০৫. দারিদ্র্য বিমোচনে কার্যকর পদক্ষেপ গ্রহণ করা।'
                          '\n০৬. চুরি-ডাকাতি-চিনতাইসহ সবরকম অভাবজনিত অপরাধ মূলোৎটাটিত হয়।'
                          '\n০৭. গরীব-ধনীর মাঝে সেতুবন্ধন সৃষ্টি হয়।'
                          '\n০৮. সম্পদের বরকত ও কার্যকারিতা বৃদ্ধি পায়।'
                          '\nরাসূলুল্লাহ (সা.) বলেন, যাকাতের সম্পদ কমে না। (সহিহ মুসলিম- হা : ৬৭৫৭, মা :, শা :, হা: ৬৯/২৫৮৮, জামি আত তিরমিযী-হা : ২০২৯, সহিহ)।'
                          '\nঅথাৎ- হয়তো দৃশ্যত: সম্পদের পরিমাণ কমবে, কিন্তু আল্লাহ তায়ালা এই স্বল্প সম্পদের মাঝেই বেশি সম্পদের কার্যকারী ক্ষমতা দিয়ে দেবেন।'
                          '\n০৯. সম্পদের পরিধি বৃদ্ধি পায়। কেননা সম্পদ যখন যাকাতের মাধ্যমে অভাবীদের মাঝে বন্টিত হয়, তখন এর উপকারিতার পরিধি বিস্তত হয়। আর যখন তা ধনীর পকেটে কুক্ষিগত থাকে, তখন এর উপকারিতার পরিধিও সংকীর্ণ হয়।'
                          '\n১০. যাকাত প্রদানকারী দান ও দয়ার গুণে গুণান্বিত হয়।'
                          '\n১১. অন্তরে অভাবীর প্রতি মায়া-মমতা সৃষ্টি হয়।'
                          '\n১২. কৃপণতার ন্যায় অসৎ গুণ থেকে নিজেকে বিরত রাখা যায়। মহান রাব্বুল আলামিন আল্লাহ তায়ালা বলেন,'
                          '\n‘তাদের সম্পদ থেকে যাকাত গ্রহণ করো; যেন তুমি সেগুলোকে এর মাধ্যমে পবিত্র ও বরকতময় করতে পার।’ (সূরা : আত তাওবাহ, আয়াত : ১০৩)।'
                  ),
                  DetailsCard(
                      number: '৩  ',
                      title: '  যাকাত ফরজ হওয়ার শর্ত',
                      desc: 'কোন ব্যক্তির ওপর ইবাদত ফরজ হওয়ার জন্য কিছু শর্ত থাকে। যাকাত ফরজ হওয়ার জন্যও কিছু শর্ত আছে। এগুলোর মধ্যে কিছু শর্ত ব্যক্তির সঙ্গে সম্পর্কিত। আবার যাকাত আর্থিক ইবাদত হওয়ায় সম্পদের সঙ্গে সম্পর্কিত কিছু শর্তও আছে। শর্তগুলো হলো-'
                          '\nমুসলিম হওয়া : যাকাত ফরজ হওয়ার জন্য প্রথম শর্ত হলো মুসলিম হওয়া। যাকাত মুসলিমদের ওপর এক প্রকারের ইবাদত বিধায় তা অমুসলিমদের জন্য ফরজ হওয়ার বিষয়টি অপ্রাসঙ্গিক।'
                          '\nবালিগ বা প্রাপ্তবয়স্ক হওয়া : শাফি’ঈ, মালিকী ও হাম্বলী মাযহাব মতে, সম্পদশালী শিশুর ওপর যাকাত ফরজ হবে। তার সম্পদ হতে তার ওয়ালী বা দায়িত্বপ্রাপ্ত অভিভাবক যাকাত আদায় করবেন। হানাফী মাযহাব মতে, প্রাপ্তবয়স্ক হওয়ার পূর্বে শিশুর সম্পদে যাকাত নেই। শিশুর সম্পদে যাকাত ফরজ না হওয়ার পক্ষে তাদের দলিল হলো রাসূলুল্লাহ (সা.) বলেছেন, ‘তিন প্রকারের মানুষের ওপর হতে তাকলীফের কলম তুলে নেয়া হয়েছে- পাগল, যতক্ষণ না তার জ্ঞান ফিরে আসে; ঘুমন্ত ব্যক্তি যতক্ষণ না সে জাগ্রত হয় এবং শিশু যতক্ষণ না সে প্রাপ্তবয়স্ক হয়’  (জামে আত তিরমিযী)। তাছাড়া যাকাত এক প্রকারের ইবাদত বিধায় শিশুর ওপর তা ফরজ হবে না, যেমন সালাত ও রোযা শিশুর ওপর ফরজ হয় না (আল-কাসানী)। তবে অধিকাংশ আলেমদের মতে শিশুদের যাকাত পরিশোধ করাই অধিকতর দলিলসম্মত।'
                          '\nবিবেক-বুদ্ধিসম্পন্ন হওয়া : হানাফী মাযহাব মতে, যাকাত ফরজ হওয়ার জন্য বুদ্ধিসম্পন্ন হওয়ার শর্ত রয়েছে। তাই পাগলের ওপর যাকাত ফরজ নয়। যুক্তি হিসেবে তাঁরা তিন প্রকারের ব্যক্তির ওপর তাখলীফের কলম তুলে নেয়ার হাদীসটি  উল্লেখ করেন। অন্যান্য মাযহাব মতে, পাগলের ওপর যাকাত ফরজ হবে, তার পক্ষ হতে দায়িত্বপ্রাপ্ত অভিভাবক যাকাত আদায় করবেন।'
                          '\nস্বাধীন ব্যক্তি হওয়া : যাকাত ফরজ হওয়ার জন্য সম্পদের মালিকের স্বাধীন হওয়া অন্যতম শর্ত। এ কারণে দাসের ওপর যাকাত ফরজ নয়। বস্তুতপক্ষে দাস কোনো সম্পদের মালিক নয়, তার সব সম্পদের মালিক তার মনিব। তাই তার ওপর যাকাত ফরজ হওয়ার কোন প্রশ্ন নেই।'
                          '\nনিসাব পরিমাণ সম্পদ থাকা : যাকাত ফরজ হওয়ার অন্যতম শর্ত হলো নিসাব পরিমাণ সম্পদ থাকা। শরীয়াহ কর্তৃক নির্ধারিত একটি নির্দিষ্ট পরিমাণ সম্পদকে নিসাব বলে। যে পরিমাণ সম্পদ থাকলে যাকাত ফরজ হয়। এ সম্পদগুলো হলো নগদ বা ব্যবসায় বিনিয়োগকৃত টাকা, স্বর্ণ, রৌপ্য, শস্য ও প্রাণী।'
                          '\nসম্পদের ওপর পূর্ণ মালিকানা : যাকাত ফরজ হওয়ার জন্য সম্পদের ওপর মালিকানা ও পূর্ণাঙ্গ দখল থাকতে হবে এবং সম্পদ ব্যবহারের নিরঙ্কুশ ক্ষমতার অধিকারী হতে হবে, অন্যথায় যাকাত ফরজ হবে না। যেমন জনকল্যাণে ওয়াকফকৃত সম্পদে যাকাত নেই। তবে কোন নির্দিষ্ট ব্যক্তির জন্য ওয়াকফ করা হলে তার যাকাত দিতে হবে।'
                          '\nযৌথ মালিকানাভুক্ত সম্পত্তির যাকাত : কোন সম্পদের দুই বা ততোধিক মালিক থাকলে প্রত্যেকে নিজ নিজ অংশের যাকাত দেবেন। যদি প্রত্যেক মালিকের অংশ আলাদাভাবে নিসাব পরিমাণ না হয় তাহলে কাউকে যাকাত দিতে হবে না। যদি কারো অংশ নিসাব পরিমাণ হয় তবে তাকে যাকাত দিতে হবে।'
                          '\nহারাম সম্পদের যাকাত : চুরি, ডাকাত, সুদ, ঘুষ, ছিনতাই, রাহাজানি, অবৈধ ব্যবসা ইত্যাদি অবৈধ উপায়ে অর্জিত সম্পদ হারাম বা অবৈধ সম্পদ বলে গণ্য। হারাম পন্থায় উপার্জনকারী ব্যক্তি ওই সম্পদের মালিক নয়। অতএব, তা খরচের অধিকারও তার নেই। যাকাত প্রদানও এক ধরনের খরচ।'
                          '\nসম্পদ বর্ধনযোগ্য হওয়া : যাকাত ফরজ হওয়ার অন্যতম উদ্দেশ্য হলো দরিদ্রকে সহযোগিতা এবং তার প্রতি সহানুভূতি প্রকাশ করা। কিন্তু নিশ্চয়ই আল্লাহ চান না যে, যাকাত আদায় করে ধনী ব্যক্তি দরিদ্র হয়ে যাক। সম্পদ যদি বর্ধনশীল না হয় এবং তা হতে বছরের পর বছর যাকাত আদায় করা হতে থাকে, তাহলে ধনী ব্যক্তি এক সময় দরিদ্র্য হয়ে যাবে। তাই যাকাত ফরজ হওয়ার জন্য সম্পদ বর্ধনশীল হওয়া অপরিহার্য।'
                          '\nসম্পদ একবছর অধিকারে থাকা : কোন সম্পদ যদি এক বছরের কম সময়ে হাতে থাকে, তবে তার ওপর যাকাত ফরজ হবে না। এ শর্তটি নগদ অর্থ, স্বর্ণ-রৌপ্য, চতুষ্পদ জন্তু ও ব্যবসায়িক পণ্যের যাকাতের ক্ষেত্রে প্রযোজ্য। রাসূলুল্লাহ (সা.) বলেছেন, ‘একবছর পূর্ণ হওয়ার পূর্বে কোন সম্পদে যাকাত নেই’। (সুনানে আবু দাউদ)'
                          '\nসম্পদ মৌলিক প্রয়োজনের অতিরিক্ত হওয়া: হানাফী মাযহাবের আলিমগণ যাকাত ফরজ হওয়ার জন্য অতিরিক্ত একটি শর্তারোপ করেন, সেটি হলো যাকাতযোগ্য সম্পদ মৌলিক প্রয়োজনের অতিরিক্ত হওয়া। তাই নিত্যপ্রয়োজনীয় সম্পদের ওপর যাকাত ফরজ হয় না। যে ব্যক্তির মৌলিক প্রয়োজনের অতিরিক্ত সম্পদ নেই তাকে ধনী বলা যায় না। আর যাকাত ফরজ করা হয়েছে ধনীদের ওপর। রাসূলুল্লাহ (সা.) যাকাত সংগ্রহ ও বণ্টনের বিষয়ে নির্দেশনা দিয়ে মু’আয (রা.)কে বলেছিলেন, ‘এটি ধনীদের কাছ থেকে আদায় করে দরিদ্রদের মাঝে বণ্টন করতে হবে।’ (সহীহ আল বুখারী)'
                          '\nঋণমুক্ত হওয়া : ঋণগ্রস্ত ব্যক্তির সম্পদের প্রথম হকদার হলো পাওনাদার। তাই প্রথমে ঋণ আদায় করতে হবে। অবশিষ্ট সম্পদ নিসাব পরিমাণ হলে যাকাত দিতে হবে। রাসূলুল্লাহ (সা.) বলেছেন, ‘কারো ওপর ঋণ থাকলে সে যেন প্রথমে তা শোধ করে, তারপর বাকি সম্পদের যাকাত আদায় করবে।’ (মুয়াত্তা)'
                          '\nমৃত ব্যক্তির যাকাত : কোনো ব্যক্তির ওপর যাকাত ফরজ হয়েছে কিন্তু তিনি তা আদায় না করে মৃত্যুবরণ করেছেন, তাহলে তার রেখে যাওয়া সম্পদ হতে ওয়ারিশগণ বা সম্পদের তত্ত্বাবধায়ক যাকাত আদায় করবেন।'
                          '\nবহির্বিশ্বে রক্ষিত সম্পদের যাকাত : কারো সম্পদ যদি বিদেশের ব্যাংকে থাকে কিংবা কেউ যদি বিদেশে ব্যবসা করেন এবং ওই সম্পদের ওপর যাকাত ফরজ হয়, তবে তাকে যাকাত আদায় করতে হবে। বিদেশে শরীয়াহ নির্ধারিত খাতে যাকাত বণ্টন করার সুযোগ থাকলে তিনি সেখানে বণ্টন করতে পারবেন, অন্যথায় নিজ দেশে যাকাত আদায় করবেন।'
                          '\nকয়েদি বা সাজাপ্রাপ্ত আসামীর যাকাত : কারাদণ্ড বা বন্দিদশা যাকাত রহিত করে না। কারাবন্দী সে হাজতি হোক বা সাজাপ্রাপ্ত হোক নিসাব পরিমাণ সম্পদের মালিক হলে তাকে যাকাত দিতে হবে। তার পক্ষ হতে তার পরিবারের সদস্য বা তার সম্পদের তত্ত্বাবধায়ক যাকাত আদায় করবেন। যদি তা না হয় মুক্তিলাভের পর পূর্বের বছরগুলোর যাকাত তাকে হিসাব করে আদায় করতে হবে।'
                          '\nমুসাফিরের যাকাত : সফরের কারণেও যাকাতের বিধান রহিত হয় না। মুসাফির ব্যক্তি (সফরকারী ব্যক্তি) যদি নিজ দেশে নিসাব পরিমাণ সম্পদের মালিক হন তাহলে ওই সম্পদের যাকাত দিতে হবে। এটা সত্য যে, সম্পদশালী মুসাফিরও যদি বিদেশে বিপদগ্রস্ত হন তাহলে তিনি যাকাত গ্রহণ করতে পারেন। তাই বলে এ বিধানের বলে দেশে রক্ষিত সম্পদের ওপর যাকাতের আবশ্যকতা রহিত হয় না।'
                  ),
                  DetailsCard(
                      number: '৪  ',
                      title: '  নিসাব',
                      desc: 'নিসাব (نصاب الزكوة)আরবি শব্দ। ইসলামী শরিয়তের পারিভাষায় যাকাতের নিসাব হলো যাকাত ফরজ হওয়ার জন্য নির্ধারিত পরিমাণ সম্পদ। নিসাবের বিবরণ- যেই পরিমাণ সম্পদ হলে যাকাত ফরজ হবে তাকে নিসাব বলে।'
                          '\n০১. স্বর্ণের ক্ষেত্রে যাকাতের নিসাব হল বিশ মিসকাল, আধুনিক হিসাবে সাড়ে সাত ভরি (মুসান্নাফে আব্দুর রাযযাক হাদীস ৭০৭৭,৭১০৪)।'
                          '\n০২. রূপার ক্ষেত্রে নিসাব হল দুইশত দেরহাম। (সহীহ বুখারী, হাদীস ১৪৪৭, সহীহ মুসলিম, হাদীস ৯৭৯) আধুনিক হিসাবে সাড়ে বায়ান্ন তোলা। এ পরিমান সোনা রূপা থাকলে যাকাত দিতে হবে।'
                          '\n০৩. প্রয়োজনের উদ্ধৃত্ত টাকা-পয়সা বা বানিজ্য দ্রব্যের মুল্য যদি সাড়ে বায়ান্ন তোলা রূপার সমপরিমাণ হয় তাহলে যাকাতের নেসাব পূর্ণ হয়েছে বলে ধরা হবে এবং এর যাকাত দিতে হবে (মুসান্নাফে ইবনে আবী শায়বা হাদীস ৯৯৩৭)।'
                          '\n০৪. যদি সোনা- রূপা, টাকা-পয়সা, কিংবা বাণিজ্য দ্রব্য এগুলোর পৃথকভাবে নেসাব পরিমান না থাকে, কিন্তু এসবের একাধিক সামগ্রী এ পরিমান রয়েছে যা একত্র করলে সাড়ে বায়ান্ন তোলা রূপার সমমূল্য বা তার চেয়ে বেশি হয় তাহলে এক্ষেত্রে সকল সম্পদ হিসাব করে যাকাত দিতে হবে (মুসান্নাফে আব্দুর রাযযাক, হাদীস ৭০৬৬,৭০৮১)।'
                          '\n০৫. নিসাবের অতিরিক্ত সোনা-রূপা, টাকা-পয়সা ও বাণিজ্য পণ্যের যাকাত আনুপাতিক হারে দিতে হবে। (মুসান্নাফে ইবনে আবী শায়বা হাদীস, ৬/৩৯০)'
                          '\n০৬. কারো কাছে সোনা-রূপা, টাকা-পয়সা কিংবা বাণিজ্য দ্রব্য পৃথকভাবে বা সম্মিলিতভাবে নিসাব পরিমান ছিল, বছরের মাঝে এ জাতীয় আরো কিছু সম্পদ কোন সুত্রে পাওয়া গেল। এ ক্ষেত্রে নতুন পাওয়া সম্পদ পুরাতন সম্পদের সাথে যোগ হবে এবং পুরাতন সম্পদের বছর পর সমুদয় সম্পদের যাকাত দিতে হবে। বছরের মাঝে যা যোগ হয়েছে তার জন্য পৃথক বছর পূর্ণ হওয়া লাগবেনা । (মুসান্নাফে আব্দুর রাযযাক হাদীস ৬৮৭২, ৭০৪০, ৭০৪৪)'
                          '\n০৭.  বছরের শুরু ও শেষে নেসাব পূর্ণ থাকলে যাকাত আদায় করতে হবে। মাঝে নিসাব কমে যাওয়া ধর্তব্য নয়। অবশ্যই বছরের মাঝে সম্পূর্ণ সম্পদ নষ্ট হয়ে যাওয়ার পর পুনরায় যদি নিসাব পরিমান সম্পদের মালিক হয় তাহলে ঐ সময় থেকে নতুন করে বছরের হিসাব আরম্ভ হবে। এক বছর পূর্ণ হওয়ার পর যাকাত আদায় করতে হবে।'
                  ),
                  DetailsCard(
                      number: '৫  ',
                      title: '  যাকাত',
                      desc: '(আরবি: زكاة‎‎ zakāt, "যা পরিশুদ্ধ করে") হলো ইসলাম ধর্মের পঞ্চস্তম্ভের একটি। প্রত্যেক স্বাধীন, পূর্ণবয়স্ক মুসলমান নর-নারীকে প্রতি বছর স্বীয় আয় ও সম্পত্তির একটি নির্দিষ্ট অংশ, যদি তা ইসলামী শরিয়ত নির্ধারিত সীমা (নিসাব পরিমাণ) অতিক্রম করে তবে, গরীব-দুঃস্থদের মধ্যে বিতরণের নিয়মকে যাকাত বলা হয়। সাধারণত নির্ধারিত সীমাতিক্রমকারী সম্পত্তির ২.৫ শতাংশ (২.৫%) বা (১/৪০) অংশ বছর শেষে বিতরণ করতে হয়।'
                          '\nইসলামের পঞ্চস্তম্ভের মধ্যে হজ্জ্ব এবং যাকাতই শুধুমাত্র শর্তসাপেক্ষ যে, তা সম্পদশালীদের জন্য ফরয বা আবশ্যিক হয়। উল্লেখ্য, নিসাব পরিমাণ হলেই যাকাত কোনো ব্যক্তির উপর ওয়াজিব হয় এবং তখন তার উপর \'যাকাত\' নামক ফরয বর্তায়; অর্থাৎ যাকাত আদায় করা ফরয। পবিত্র ধর্মগ্রন্থ কোরআনে "যাকাত" শব্দের উল্লেখ এসেছে ৩২ বার।কুরআনে নামাজের পরেই সবচেয়ে বেশি গুরুত্ব পূর্ন বিষয় হিসাবে উল্লেখ এই যাকাত।'
                  ),
                ],
              ),
            ),

            Padding(
              padding: const EdgeInsets.all(4),
              child: MaterialButton(
                shape: RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(8)
                ),
                height: 50,
                onPressed: (){
                  Navigator.push(context, MaterialPageRoute(builder: (context) => ZakatCalculator()));
                },
                color: zColor,
                child: Row(
                  mainAxisAlignment: MainAxisAlignment.center,
                  children: [
                    Icon(Icons.add, color: Colors.white,size: 30,),
                    SizedBox(width: 5,),
                    Text('হিসাব করুন',
                      style: TextStyle(
                        fontFamily: 'Bangla',
                        color: Colors.white,
                        fontSize: 19,
                      ),)
                  ],
                ),
              ),
            )
          ],
        ),
      ),
    );
  }
}
