Repository: ratulhasanruhan/productive_muslim
Catalog: lib/l10n/intl_*.arb
Languages: bn

source: Allow Location
bn: লোকেশনের অনুমতি

source: Al Quran
bn: আল কুরআন

# app_name
source: Productive Muslim
bn: প্রোডাক্টিভ মুসলিম

# ayat
source: Verse
bn: আয়াত

source: Bookmark
bn: বুকমার্ক

# change_language_later
source: You can change the language later from the settings.
bn: আপনি পরবর্তীতে সেটিংস থেকে ভাষা পরিবর্তন করতে পারবেন।

source: Hanafi
bn: হানাফী

source: Home
bn: হোম

source: Juz
bn: পারা

source: Last Read
bn: শেষ পড়েছেন

source: Let's Begin
bn: শুরু করুন

# location_need_for
source: We need your location to show you the nearest masjid and prayer times.
bn: আপনার অবস্থানের উপর ভিত্তি করে নামাজের সময় দেখানোর জন্য লোকেশন প্রয়োজন।

source: Location Permission
bn: লোকেশন পারমিশন

source: Prayer
bn: সালাত

source: Quran
bn: কুরআন

# select_laguage
source: Select Language
bn: ভাষা নির্বাচন

source: Select Madhab
bn: মাযহাব নির্বাচন

# select_madhab_according_of
source: Please select madhab according to your school of thought.
bn: আপনার মাযহাব অনুযায়ী নামাজের সময় দেখানো হবে।

source: Shafi, Maliki, Hanbali
bn: শাফিঈ, মালিকি, হাম্বলী

source: Surah
bn: সূরা

source: Task
bn: টাস্ক
